Revit 2024 API
WorksetConfiguration Constructor (WorksetConfiguration)
 Constructs a new copy of the input WorksetConfiguration object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public WorksetConfiguration(
	WorksetConfiguration other
)
Visual Basic
Public Sub New ( _
	other As WorksetConfiguration _
)
Visual C++
public:
WorksetConfiguration(
	WorksetConfiguration^ other
)
Parameters
other
Type: Autodesk.Revit.DB.WorksetConfiguration
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
WorksetConfiguration Class
WorksetConfiguration Overload
Autodesk.Revit.DB Namespace